app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "hahaha"], ["updated_at", "2016-01-22 04:24:38.089488"], ["id", 3]]